app/controllers/api/v1/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Bob Marley "], ["created_at", "2021-05-10 06:18:02.629814"], ["updated_at", "2021-05-10 06:18:02.629814"]]
---
      def create
        @artist = Artist.new(artist_params)

        if @artist.save

UPDATE "artists" SET "name" = $1, "updated_at" = $2 WHERE "artists"."id" = $3  [["name", "Jay Hova"], ["updated_at", "2021-05-10 07:02:22.059016"], ["id", 3]]
---
      def update
        if @artist.update(artist_params)

DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 1]]
---
      def destroy
        @artist.destroy