app/controllers/api/v1/records_controller.rb

      def index
        @records = current_user.records.all
---
SELECT "records".* FROM "records" WHERE "records"."user_id" = $1  [["user_id", 3]]

      def create
        @record = current_user.records.build(record_params)

        if @record.save
---
INSERT INTO "records" ("title", "year", "artist_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Whatever"], ["year", "1997"], ["artist_id", 19], ["user_id", 2], ["created_at", "2021-05-10 15:01:08.654535"], ["updated_at", "2021-05-10 15:01:08.654535"]]

      def update
        if @record.update(record_params)
---
UPDATE "records" SET "artist_id" = $1, "updated_at" = $2 WHERE "records"."id" = $3  [["artist_id", 21], ["updated_at", "2021-05-11 12:18:52.919326"], ["id", 1]]

      def set_record
        @record = current_user.records.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."user_id" = $1 AND "records"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]