app/controllers/application_controller.rb

    def current_user
      @current_user ||= User.find(payload['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]