app/controllers/signin_controller.rb

  def create
    #Search for user through email address
    user = User.find_by!(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "JustinAnMoreno@gmail.com"], ["LIMIT", 1]]