app/controllers/signup_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
#Define User
    user = User.new(user_params)
    if user.save